#### Terraform Format and Style `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform

Acquiring state lock. This may take a few moments...
module.example_staging_vpc.aws_route_table_association.public["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-0d10aeaee04dd1c4e]
module.example_staging_vpc.aws_internet_gateway.public: Refreshing state... [id=igw-0d6be2a49253325d0]
module.example_staging_vpc.aws_nat_gateway.private["eu-west-1b"]: Refreshing state... [id=nat-047936c0b86e89dff]
module.example_staging_vpc.aws_route_table_association.private["10.0.4.0/24"]: Refreshing state... [id=rtbassoc-0fb8ef12fb59a0149]
module.example_staging_vpc.aws_eip.ngw["eu-west-1b"]: Refreshing state... [id=eipalloc-05efaca3c9e7baf57]
module.example_staging_vpc.aws_vpc.webapp: Refreshing state... [id=vpc-013ba85f9381c851c]
module.example_staging_vpc.aws_subnet.public["10.0.1.0/24"]: Refreshing state... [id=subnet-01a103cc645f1a3d7]
module.example_staging_vpc.aws_route_table.public: Refreshing state... [id=rtb-0cf7aea7d59007c63]
module.example_staging_vpc.aws_subnet.private["10.0.4.0/24"]: Refreshing state... [id=subnet-0846d1e0b51ded0a4]
module.example_staging_vpc.aws_route_table.private["eu-west-1b"]: Refreshing state... [id=rtb-04dccc9bb168d05bb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.example_staging_vpc.aws_eip.ngw["eu-west-1b"] will be destroyed
  # (because aws_eip.ngw is not in configuration)
  - resource "aws_eip" "ngw" {
      - allocation_id            = "eipalloc-05efaca3c9e7baf57" -> null
      - arn                      = "arn:aws:ec2:eu-west-1:654654301190:elastic-ip/eipalloc-05efaca3c9e7baf57" -> null
      - domain                   = "vpc" -> null
      - id                       = "eipalloc-05efaca3c9e7baf57" -> null
      - network_border_group     = "eu-west-1" -> null
      - public_dns               = "ec2-79-125-124-48.eu-west-1.compute.amazonaws.com" -> null
      - public_ip                = "79.125.124.48" -> null
      - public_ipv4_pool         = "amazon" -> null
      - tags                     = {
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - tags_all                 = {
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - vpc                      = true -> null
        # (8 unchanged attributes hidden)
    }

  # module.example_staging_vpc.aws_internet_gateway.public will be destroyed
  # (because aws_internet_gateway.public is not in configuration)
  - resource "aws_internet_gateway" "public" {
      - arn      = "arn:aws:ec2:eu-west-1:654654301190:internet-gateway/igw-0d6be2a49253325d0" -> null
      - id       = "igw-0d6be2a49253325d0" -> null
      - owner_id = "654654301190" -> null
      - tags     = {
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-igw-eu-west-1"
          - "Region"      = "eu-west-1"
        } -> null
      - tags_all = {
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-igw-eu-west-1"
          - "Region"      = "eu-west-1"
        } -> null
      - vpc_id   = "vpc-013ba85f9381c851c" -> null
    }

  # module.example_staging_vpc.aws_nat_gateway.private["eu-west-1b"] will be destroyed
  # (because aws_nat_gateway.private is not in configuration)
  - resource "aws_nat_gateway" "private" {
      - allocation_id                      = "eipalloc-05efaca3c9e7baf57" -> null
      - association_id                     = "eipassoc-05699aff8cd7f73a8" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-047936c0b86e89dff" -> null
      - network_interface_id               = "eni-065d6d8c1a3484551" -> null
      - private_ip                         = "10.0.1.80" -> null
      - public_ip                          = "79.125.124.48" -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-01a103cc645f1a3d7" -> null
      - tags                               = {
          - "AZ"          = "eu-west-1b"
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-ngw-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - tags_all                           = {
          - "AZ"          = "eu-west-1b"
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-ngw-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
    }

  # module.example_staging_vpc.aws_route_table.private["eu-west-1b"] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:eu-west-1:654654301190:route-table/rtb-04dccc9bb168d05bb" -> null
      - id               = "rtb-04dccc9bb168d05bb" -> null
      - owner_id         = "654654301190" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-047936c0b86e89dff"
                # (11 unchanged attributes hidden)
            },
        ] -> null
      - tags             = {
          - "AZ"          = "eu-west-1b"
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-private-rt-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - tags_all         = {
          - "AZ"          = "eu-west-1b"
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-private-rt-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - vpc_id           = "vpc-013ba85f9381c851c" -> null
    }

  # module.example_staging_vpc.aws_route_table.public will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:eu-west-1:654654301190:route-table/rtb-0cf7aea7d59007c63" -> null
      - id               = "rtb-0cf7aea7d59007c63" -> null
      - owner_id         = "654654301190" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - gateway_id                 = "igw-0d6be2a49253325d0"
                # (11 unchanged attributes hidden)
            },
        ] -> null
      - tags             = {
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-public-rt"
          - "Region"      = "eu-west-1"
        } -> null
      - tags_all         = {
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-public-rt"
          - "Region"      = "eu-west-1"
        } -> null
      - vpc_id           = "vpc-013ba85f9381c851c" -> null
    }

  # module.example_staging_vpc.aws_route_table_association.private["10.0.4.0/24"] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0fb8ef12fb59a0149" -> null
      - route_table_id = "rtb-04dccc9bb168d05bb" -> null
      - subnet_id      = "subnet-0846d1e0b51ded0a4" -> null
        # (1 unchanged attribute hidden)
    }

  # module.example_staging_vpc.aws_route_table_association.public["10.0.1.0/24"] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0d10aeaee04dd1c4e" -> null
      - route_table_id = "rtb-0cf7aea7d59007c63" -> null
      - subnet_id      = "subnet-01a103cc645f1a3d7" -> null
        # (1 unchanged attribute hidden)
    }

  # module.example_staging_vpc.aws_subnet.private["10.0.4.0/24"] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:eu-west-1:654654301190:subnet/subnet-0846d1e0b51ded0a4" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-west-1b" -> null
      - availability_zone_id                           = "euw1-az3" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0846d1e0b51ded0a4" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "654654301190" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "AZ"          = "eu-west-1b"
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-private-sn-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - tags_all                                       = {
          - "AZ"          = "eu-west-1b"
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-private-sn-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - vpc_id                                         = "vpc-013ba85f9381c851c" -> null
        # (4 unchanged attributes hidden)
    }

  # module.example_staging_vpc.aws_subnet.public["10.0.1.0/24"] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:eu-west-1:654654301190:subnet/subnet-01a103cc645f1a3d7" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-west-1b" -> null
      - availability_zone_id                           = "euw1-az3" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-01a103cc645f1a3d7" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "654654301190" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "AZ"          = "eu-west-1b"
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-public-sn-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - tags_all                                       = {
          - "AZ"          = "eu-west-1b"
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-public-sn-eu-west-1b"
          - "Region"      = "eu-west-1"
        } -> null
      - vpc_id                                         = "vpc-013ba85f9381c851c" -> null
        # (4 unchanged attributes hidden)
    }

  # module.example_staging_vpc.aws_vpc.webapp will be destroyed
  # (because aws_vpc.webapp is not in configuration)
  - resource "aws_vpc" "webapp" {
      - arn                                  = "arn:aws:ec2:eu-west-1:654654301190:vpc/vpc-013ba85f9381c851c" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-04eb1270d3b772dce" -> null
      - default_route_table_id               = "rtb-0d81d0345b584b137" -> null
      - default_security_group_id            = "sg-0c60981f2eca486f8" -> null
      - dhcp_options_id                      = "dopt-0b7d70b17149699f5" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-013ba85f9381c851c" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0d81d0345b584b137" -> null
      - owner_id                             = "654654301190" -> null
      - tags                                 = {
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-vpc"
          - "Region"      = "eu-west-1"
        } -> null
      - tags_all                             = {
          - "Application" = "enplat"
          - "Environment" = "staging"
          - "Name"        = "enplat-staging-vpc"
          - "Region"      = "eu-west-1"
        } -> null
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.ngw["eu-west-1b"] will be created
  + resource "aws_eip" "ngw" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all             = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eip-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.public will be created
  + resource "aws_internet_gateway" "public" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-igw-eu-west-1"
          + "Region"      = "eu-west-1"
        }
      + tags_all = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-igw-eu-west-1"
          + "Region"      = "eu-west-1"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.private["eu-west-1b"] will be created
  + resource "aws_nat_gateway" "private" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all                           = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-ngw-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
    }

  # module.vpc.aws_route_table.private["eu-west-1b"] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-rt-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all         = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-rt-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-public-rt"
          + "Region"      = "eu-west-1"
        }
      + tags_all         = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-public-rt"
          + "Region"      = "eu-west-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["10.0.4.0/24"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["10.0.1.0/24"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private["10.0.4.0/24"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Deployment"  = "v1"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-sn-eu-west-1b"
          + "Region"      = "eu-west-1"
          + "Release"     = "1.0.0"
        }
      + tags_all                                       = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Deployment"  = "v1"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-private-sn-eu-west-1b"
          + "Region"      = "eu-west-1"
          + "Release"     = "1.0.0"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public["10.0.1.0/24"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-public-sn-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + tags_all                                       = {
          + "AZ"          = "eu-west-1b"
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-public-sn-eu-west-1b"
          + "Region"      = "eu-west-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.webapp will be created
  + resource "aws_vpc" "webapp" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-vpc"
          + "Region"      = "eu-west-1"
        }
      + tags_all                             = {
          + "Application" = "enplat"
          + "Environment" = "staging"
          + "Name"        = "enplat-staging-vpc"
          + "Region"      = "eu-west-1"
        }
    }

Plan: 10 to add, 0 to change, 10 to destroy.

Changes to Outputs:
  ~ private_subnets = {
      ~ "10.0.4.0/24" = {
          ~ tags                    = {
              + Deployment = "v1"
              + Release    = "1.0.0"
              - Type       = "private"
            }
            # (3 unchanged attributes hidden)
        }
    }
  ~ vpc_id          = "vpc-013ba85f9381c851c" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pushed by: @ridasaleemsage, Action: `pull_request`*